

yuan_text = "[Тарифы](https://zgcvpn.ru/#tariffs)\n\n" \
            "Реквизиты для оплаты:\n\n" \
            "Alipay:\n" \
            "url\n\n" \
            "WeChat pay:\n" \
            "url\n\n" \
            "*Пришлите пожалуйста скриншот оплаты*."

yuan_text_vk = "Тарифы: https://zgcvpn.ru/#tariffs\n\n" \
            "Реквизиты для оплаты:\n\n" \
            "Alipay:\n" \
            "url\n\n" \
            "WeChat pay:\n" \
            "url\n\n" \
            "Пожалуйста, пришлите скриншот оплаты."

rub_text = """Тарифы можно посмотреть тут https://zgcvpn.ru/#tariffs

❗️ Пожалуйста, НИЧЕГО НЕ УКАЗЫВАЙТЕ В КОММЕНТАРИЯХ к переводу.
Пришлите скриншот оплаты или оплатите на сайте zgcvpn.ru/#tarrifs.

СБЕРБАНК:
1

Тинькофф:
1

Приват (гривны):
1

Киви:
+1

Яндекс деньги:
1"""

rub_text_vk = """Тарифы можно посмотреть тут https://zgcvpn.ru/#tariffs

❗️ Пожалуйста, НИЧЕГО НЕ УКАЗЫВАЙТЕ В КОММЕНТАРИЯХ к переводу.
Пришлите скриншот оплаты или оплатите на сайте zgcvpn.ru/#tarrifs.

СБЕРБАНК:
1

Тинькофф:
1

Приват (гривны):
1

Киви:
+1

Яндекс деньги:
1"""

trial_text = "Чтобы получить пробный период перейдите на [сайт](http://zgcvpn.ru) и укажите вашу почту.\n\n" \
             "Если во время настройки возникнут проблемы свяжитесь с нами!"

trial_text_vk = "Чтобы получить пробный период перейдите на сайт http://zgcvpn.ru и укажите вашу почту.\n\n" \
             "Если во время настройки возникнут проблемы свяжитесь с нами!"

send_email = "Пожалуйста, пришлите адрес вашей электронной почты.\n\n" \
             "Если вы являетесь нашим клиентом - обязательно пришлите адрес, на который регистрировали VPN!"

buttons_menu = "Выберите на клавиатуре снизу интересующий вас вопрос"

pay = """Спасибо за оплату!\n
🔥 Если ваша подписка не заработала – zgcvpn.ru/update\n 
🔥 Наши услуги лично для вас –  https://market.zgc.su/\n
🔥 АКЦИИ и ответы на вопросы –  https://market.zgc.su/vpnfaq\n
🔥 Наши публикации и новости о VPN –  https://market.zgc.su/zgcvpnblog\n

Пользуясь нашим сервисом, вы соглашаетесь с [правилами](https://zgcvpn.ru/rules).\n 
Приятного пользования!"""

pay_vk = """Спасибо за оплату!\n
🔥 Если ваша подписка не заработала – zgcvpn.ru/update\n 
🔥 Наши услуги лично для вас –  https://market.zgc.su/\n
🔥 АКЦИИ и ответы на вопросы –  https://market.zgc.su/vpnfaq\n
🔥 Наши публикации и новости о VPN –  https://market.zgc.su/zgcvpnblog\n

Пользуясь нашим сервисом, вы соглашаетесь с правилами https://zgcvpn.ru/rules.\n 
Приятного пользования!"""

pay_type = "Оплата в рублях или в юанях?\n\n"\
           "Если у вас возникнут другие вопросы по оплате - нажмите 'Связаться с поддержкой'"

close = "Чат завершен, спасибо за обращение!\n\n" \
        "Пожалуйста, оцените качество поддержки, чтобы мы могли стать лучше"

push_buttons = "\U0000274C Сообщение не доставлено\n" \
               "Нажмите на кнопку с интересующей вас информацией\n\n"\
               "Если у вас возникла проблема - нажмите 'Связаться с поддержкой'"

non_working = f"Мы работаем по Пекину с 17:00 до 22:00 в рабочие дни и сейчас не можем ответить на ваши вопросы.\n\n" \
                 f"Если у вас есть срочный вопрос - нажмите кнопку 'Срочная связь' и мы постараемся ответить как можно быстрее"

sheets_empty = "В гугл таблицах есть пропуск в одной из строк, колонки email, date, tg_id, vk_id, fb_id. " \
               "Все они должны быть заполнены, если ячейка пуста - пишем 0"

first_install = "Пожалуйста, подскажите:\n" \
                "1. С каким устройством возникла проблема?\n" \
                "2. Можете прислать скриншот проблемы?\n\n" \
                "Этот способ связи предназначен только для новых клиентов."

turk = "Для перехода на сайт для жителей Туркменистана нажмите 'Сайт обслуживания'\n\n" \
       "Для получения информации по подключению нажмите 'Как подключить?'\n\n" \
       "В случае возникновения срочного вопроса пишите на почту с темой письма «ТМ» vpn@zgc.su"

coop = "Вы можете описать свое предложение, перейдя по ссылке ниже"

shop = "Узнайте все о наших продуктах"

support = "Для решения проблемы укажите:\n" \
          "1) Устройство\n" \
          "2) Выбранный сервер\n" \
          "3) После чего возникла проблема\n" \
          "4) На каких сайтах или ресурсах\n" \
          "5) Пришлите скриншот (снимок экрана, на котором видно проблему)\n\n" \
          "Вы также можете попробовать найти решение проблемы в нашем [FAQ](market.zgc.su/vpnfaq)"

support_vk = "Для решения проблемы укажите:\n" \
          "1) Устройство\n" \
          "2) Выбранный сервер\n" \
          "3) После чего возникла проблема\n" \
          "4) На каких сайтах или ресурсах\n" \
          "5) Пришлите скриншот (снимок экрана, на котором видно проблему)\n\n" \
          "Вы также можете попробовать найти решение проблемы в нашем FAQ market.zgc.su/vpnfaq"

type_support = "Чат с поддержкой открыт\n\n" \
               "Какая проблема требует помощи? Первичная настройка (для недавно подключившихся клиентов) " \
               "или что-то другое?\n\n"

get_better = "Пожалуйста, опишите одним сообщением, что нам стоит улучшить в работе сервиса?"

email_already_used = "Этот email уже называл ранее другой пользователь.\n" \
                     "Диалог с поддержкой открыт, подтвердите, что это ваша почта\n\n"

edit_wrong_mail = "Укажите в ответе неправильную почту, которую надо удалить"
edit_true_mail = "Укажите в ответе существующую в базе почту, в которую надо перенести айди клиента"
edit_confirm = "ID телеграма, вк и фб (если они не равны нулю) от неправильной почты будут перенесены в правильную, " \
            "а запись с неправильной почтой будет удалена из базы.\n\nПродолжить? Да/Нет ответом"

mailing_tariffs = "Перечислите через пробел тарифы для рассылки в ответе на это сообщение"
mailing_message = "Пришлите в ответе сообщение, которое хотите отправить выбранным тарифам"

left3days = "Здравствуйте! Это ваш VPN провайдер. Напоминаем вам, о том, что ваша подписка заканчивается через 3 дня. Будете продлевать?"
left1day = "Здравствуйте! Это ваш VPN провайдер. Напоминаем вам, о том, что ваша подписка заканчивается завтра. Будете продлевать?"
left_today = "Здравствуйте! Это ваш VPN провайдер. Напоминаем вам, о том, что ваша подписка заканчивается сегодня. Будете продлевать?"

info = "Команды:\n" \
       "/info: Информация, которую читаете сейчас\n" \
       "Ответы на сообщения клиентов:\n" \
       "пока, конец, off, /q : Закрыть диалог, клиент получит сообщение о завершении диалога и просьбу оценить сервис\n\n" \
       "/оплата, оп : Закрыть диалог, клиент получит сообщение с благодарностью и ссылку на инструкцию\n\n" \
       "/закрыть: Закрыть диалог, клиент не получит никакого сообщения\n" \
       "Регистр команд не важен\n\n" \
       "Ответ на сообщения, в которых есть айди клиента (внизу сообщения). " \
       "Для телеграма доступны текст, фото, видео, файлы, голосовые, аудио, стикеры (как для клиента, так и для поддержки)\n\n" \
       "Для ВК: клиент может присылать текст, фото, голосовые. Поддержка может отвечать текстом, фото или файлом\n\n" \
       "Для ФБ: клиент может прислать текст или фото. Поддержка может отвечать только текстом"
